eisup_2019_docmng_integration/src/Documents/абс_ПриведениеРегистровКОСВ/абс_ПриведениеРегистровКОСВ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ПриведениеРегистровКОСВ</name>
  <posting>Deny</posting>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижений</name>
    <type>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.абс_ВидыОперацийПриведениеРегистровКОСВ</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыПриведениеРегистровКОСВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаполнения</name>
    <comment>0 - по всем , 1 - без признака в договоре &quot;Вести по документам..&quot; 2- с признаком </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеОСВ</name>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОСВ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегистр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСуммаОСВ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСуммаРегистр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВестиПоДокументам</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сторнировать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасхождение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСуммаРасхождение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеРегистра</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегистр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСуммаРегистр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>DocumentRef.СчетНаОплатуПоставщика</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.СчетНаОплатуПокупателю</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОСВ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяСуммаОСВ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Enums/абс_ВидыОперацийПриведениеРегистровКОСВ/абс_ВидыОперацийПриведениеРегистровКОСВ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыОперацийПриведениеРегистровКОСВ</name>
  <enumValues>
    <name>АвансыПолученные</name>
  </enumValues>
  <enumValues>
    <name>АвансыВыданные</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПокупателями</name>
  </enumValues>
  <enumValues>
    <name>РасчетыСПоставщиками</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_ПриведениеРегистровКОСВ/Forms/ВыборДокументаРасчетов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//УстановитьУсловноеОформление();
	
	РасчетыСПотсавщиками = Ложь;
	Если Документы.абс_ПриведениеРегистровКОСВ.ПолучитьМассивСчетов(Перечисления.абс_ВидыОперацийПриведениеРегистровКОСВ.АвансыВыданные).Найти(Параметры.Счет) <> Неопределено Тогда 
		РасчетыСПотсавщиками = Истина;
	ИначеЕсли Документы.абс_ПриведениеРегистровКОСВ.ПолучитьМассивСчетов(Перечисления.абс_ВидыОперацийПриведениеРегистровКОСВ.РасчетыСПоставщиками).Найти(Параметры.Счет) <> Неопределено Тогда 
		РасчетыСПотсавщиками = Истина;
	КонецЕсли;
	
	Если РасчетыСПотсавщиками Тогда 
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "РасчетыПоРеализацииВУсловныхЕдиницахОрганизации", "РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации");  
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("Организация", Параметры.Организация);
	Список.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Контрагент);
	
	//Если Список.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыборОснованияПлатежа")) <> Неопределено Тогда
	//	Список.Параметры.УстановитьЗначениеПараметра("ВыборОснованияПлатежа", Параметры.ВыборОснованияПлатежа);
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Договор) Тогда 
		ОтборЭлемента = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДоговорКонтрагента");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Параметры.Договор;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
		
	ОповеститьОВыборе(Новый Структура("Документ, Сделка",
				СтрокаТаблицы.Ссылка,
				СтрокаТаблицы.Сделка));
	
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьДокумент(Команда)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы <> Неопределено Тогда
				
		ОповеститьОВыборе(Новый Структура("Документ, Сделка",
			СтрокаТаблицы.Ссылка,
			СтрокаТаблицы.Сделка));
	Иначе
		Закрыть();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	
	СтрокаТаблицы = Элементы.Список.ТекущиеДанные;
	Если СтрокаТаблицы <> Неопределено Тогда
		ОткрытьЗначение(СтрокаТаблицы.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	//УсловноеОформление.Элементы.Очистить();

	////

	//Элемент = УсловноеОформление.Элементы.Добавить();

	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Номер.Имя);

	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Дата.Имя);

	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Тип.Имя);

	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Сумма.Имя);

	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Валюта.Имя);

	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Организация.Имя);

	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Контрагент.Имя);

	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Ссылка.Имя);

	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Список.Имя);

	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.СостояниеДокумента");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	//ОтборЭлемента.ПравоеЗначение = 0;

КонецПроцедуры
